wiki/sicp.org
** 练习1.18

   有了1.16的基础，再来这道题就好多了，这题的难点是构造类似1.16中的ab^n。和1.16不同，这里的构造等式如下（状态变量定义为s）：

   1. b为偶数：s + ab = s + a*2 * b/2
   2. b为奇数：s + ab = (s + a) + a * (b - 1)

   于是，有如下解：

   : (define (my* a b)
   :   (my*-iter 0 a b))
   :
   : (define (my*-iter s a b)
   :   (cond ((= b 0) s)
   :         ((even? b) (my*-iter s (double a) (halve b)))
   :         (else (my*-iter (+ s a) a (- b 1)))))

** 练习1.19

   这个题是要求p'和q'，根据T^2 = T'，可以得到两个关于p'和q'的方程，联立方程可得解。

   这两个二元一次方程本身不难，但因为项太多，还有平方，所以如果打字打出来会很蛋疼，所以就不打了，最后解出的结果是：

   : p' = p^2 + q^2
   : q' = q^2 + 2pq

   吐槽：外国人真尼玛牛，一个特例斐波那契数列，能想到通用的T变换，而且，还尼玛T^2 = T'。。

** 练习1.20

   个人觉得这个题的水平略低，因为只是按照定义对过程调用进行展开而已。关键是，如果你展开的内容少一点也可以接受，但是 =(gcd 206 40)= 的正规序展开内容太多了，我写了几层，就写不下去了。。最后看了[[http://www.billthelizard.com/2010/01/sicp-exercise-120-gcd.html][这里]]的详细展开内容，那哥们真是耐得住。。其实题目的意思大概是想让我们对这两种展开方式有一个比较深刻的理解，但这样大量的重复性工作，显得没有必要，所以我没有耐得住寂寞展开到最后。。从那哥们展开的结果来看，最后的答案是18和4。

** 练习1.21

   把书中的的 =smallest-divisor= 及相关定义照执行一遍就行了，结果如下：

   : (smallest-divisor 199)    => 199
   : (smallest-divisor 1999)   => 1999
   : (smallest-divisor 19999)  => 7

   PS：SICP中文翻译中错误很多啊，比方说上面跟 =smallest-divisor= 相关的 =divides?= 定义，其中对 =remainder= 过程的调用就把参数a和b写反了，坑爹。。页脚的注释d/n应该是n/d。。

** 练习1.22

   我使用的Scheme实现是Racket，这个实现并没有包含如题目中所说的 =runtime= ，于是我Google了一下，发现有一个过程叫 =current-inexact-milliseconds= 可以达到要求，于是就用它代替了 =runtime= 。

   这个题目的实现代码如下：

   : (define (timed-prime-test n)
   :   (newline)
   :   (display n)
   :   (start-prime-test n (current-inexact-milliseconds)))
   :
   : (define (start-prime-test n start-time)
   :   (if (prime? n)
   :       (report-time (- (current-inexact-milliseconds) start-time))
   :       #f))  ;; 这里因为Racket实现不允许if只有一个分支，所以用#f来表示另一个分支
   :
   : (define (report-time elapsed-time)
   :   (display " *** ")
   :   (display elapsed-time))
   :
   : (define (search-for-primes start count)
   :   (cond ((= count 0) (newline))
   :         ((timed-prime-test start) (search-for-primes (next-odd start) (- count 1)))
   :         (else (search-for-primes (next-odd start) count))))
   :
   : (define (next-odd n)
   :   (if (= (remainder n 2) 0)
   :       (+ 1 n)
   :       (+ 2 n)))

   测试了几组数据，得到以下结果（不是奇数的行已删去）：

   : 100000000003 *** 24.06689453125
   : 100000000019 *** 14.223876953125
   : 100000000057 *** 15.403076171875
   : >
   : 1000000000039 *** 49.025146484375
   : 1000000000061 *** 48.720947265625
   : 1000000000063 *** 47.57080078125
   : >
   : 10000000000037 *** 154.43701171875
   : 10000000000051 *** 143.823974609375
   : 10000000000099 *** 147.25390625

   取平均值除了一下，时间比值为2.706和3.066，这两个离√10还差得比较多，不过可能是受CPU，系统环境的影响，随机性较强，不过比值应该是√10这一点还是很明确的。

** 练习1.23

   : (define (next n)
   :   (if (= n 2)
   :       3
   :       (+ n 2)))
   :
   : (define (find-divisor n test)
   :   (cond ((> (* test test) n) n)
   :         ((divides? n test) test)
   :         (else (find-divisor n (next test)))))

   得到结果如下（取了三组和1.22中对应的值）：

   : 100000000003 *** 14.049072265625
   : 100000000019 *** 10.261962890625
   : 100000000057 *** 9.14697265625
   : >
   : 1000000000039 *** 40.97705078125
   : 1000000000061 *** 30.837890625
   : 1000000000063 *** 31.4189453125
   : >
   : 10000000000037 *** 103.964111328125
   : 10000000000051 *** 102.067138671875
   : 10000000000099 *** 94.930908203125

   分别计算平均消耗时间比值，得到三个值：1.61，1.41，1.48，这几个值是明显是小于2的。可能虽然步数是少了一半，但是在运行过程中的一些其它消耗，导致了时间比值小于2。

   然后我又试了一下，证明这多出来的时间消耗是来自 =next= 过程调用，将 =find-divisor= 以及 =smallest-divisor= 过程进行重定义为以下形式：

   : (define (find-divisor n test)
   :   (cond ((> (* test test) n) n)
   :         ((divides? n test) test)
   :         (else (find-divisor n (+ test 2))))) ;; 直接加2，不再调用next过程
   :
   : (define (smallest-divisor n)
   :   (find-divisor n 3)) ;; 直接从3开始

   结果如下：

   : 100000000003 *** 13.234130859375
   : 100000000019 *** 8.0458984375
   : 100000000057 *** 7.89599609375
   : >
   : 1000000000039 *** 28.672119140625
   : 1000000000061 *** 25.3388671875
   : 1000000000063 *** 25.071044921875
   : >
   : 10000000000037 *** 78.4560546875
   : 10000000000051 *** 78.115966796875
   : 10000000000099 *** 71.85498046875

   可以看到，这里的时间消耗确实是比1.22中减半了。

** 练习1.24

   这个练习，将 =start-prime-test= 中的 =prime?= 换成 =fast-prime?= 即可：

   : (define (start-prime-test n start-time)
   :   (if (fast-prime? n 3)  ;; 测试的次数取3
   :       (report-time (- (current-inexact-milliseconds) start-time))
   :       #f))

   然后进行测试，得到以下结果（最高只能到10的9次方，因为再高的话，超过了int型的最大值，这时 =random= 函数会报错）：

   : 1009 *** 0.014892578125
   : 1013 *** 0.01611328125
   : 1019 *** 0.015869140625
   : >
   : 10007 *** 0.02099609375
   : 10009 *** 0.02099609375
   : 10037 *** 0.02001953125
   : >
   : 100003 *** 0.02490234375
   : 100019 *** 0.02392578125
   : 100043 *** 0.02392578125
   : >
   : 1000003 *** 0.028076171875
   : 1000033 *** 0.028076171875
   : 1000037 *** 0.029052734375
   : >
   : 10000019 *** 0.032958984375
   : 10000079 *** 0.033203125
   : 10000103 *** 0.032958984375
   : >
   : 100000007 *** 0.0380859375
   : 100000037 *** 0.0380859375
   : 100000039 *** 0.0380859375
   : >
   : 1000000007 *** 0.041015625
   : 1000000009 *** 0.0419921875
   : 1000000021 *** 0.0419921875

   增长速度是O(log n)，所以10^6附近应该是10^3附近所消耗时间的两倍，10^9是三倍：从上面的结果来看，10^6次方的数据比较接近（0.028/0.014），但10^9则要小了不少，只有大概2.67倍左右；10^8应该是10^4的两倍，这个数据也还比较接近（0.038/0.020）。

** 练习1.25

   其实这个问题的答案在前面的脚注46中就说了：

   #+begin_quote
   这种技术非常有用，因为它意味着我们的计算中不需要去处理比m大很多的数（请与练习1.25比较）。
   #+end_quote

   原来的 =expmod= 函数是利用了以下的等式：

   : (x * y) % m = [(x % m) * (y % m)] % m

   这样，如果 =x*y= 的值很大的话，可以分解成两个小于m的数再取模，这样计算起来就要容易很多。

   而1.25中的 =expmod= 的定义也是没问题的：先算出乘方值，再取模。但是需要注意的是，这个乘方值可能很大，这样再求模，可能就会很慢，没有办法和原来版本的高效性相提并论。

** 练习1.26

   这个题还比较好理解，在使用 =square= 的时候，只需要在 =expmod= 内部执行一次递归调用，但直接使用乘法的话，会执行两次递归调用，情况如下：

   | 次数  | 递归情况(square)   | 递归情况(*)            |
   |------+------------------+-----------------------|
   |    1 | n                | n                     |
   |    2 | n/2              | n/2 * n/2             |
   |    3 | n/4              | n/4 * n/4 * n/4 * n/4 |
   |  ... |                  |                       |

   注：上表没有考虑 =n-1= 的情况，因为 =n-1= 作为常数级的衰减（请原谅，我自己发明了“衰减”这个词），和指数级衰减比起来可以忽略。

   可以看到，使用 =square= 的情况是指数级衰减，所以最终是Θ(log n)；直接使用乘法虽然也是指数级衰减，但是衰减的同时，递归调用数却在指数级增加，刚好和衰减抵消，于是就是Θ(n)。

** 练习1.27

   这个题目比较简单，定义的两个函数如下：

   : (define (carmichael-check n a)
   :   (cond ((not (= (expmod a n n) a)) false)
   :         ((> a 1) (carmichael-check n (- a 1)))
   :         (else true)))
   :
   : (define (carmichael-test n)
   :   (carmichael-check n (- n 1)))

   需要测试Carmichael数的时候，执行 =carmichael-test= 即可。这个测试有一点缺陷就是，不能把真正的质数和Carmichael数分开，不过题目是要求验证Carmichael数，而并不是求Carmichael数，所以这点缺陷也不算是缺陷。

