wiki/sicp/index.html
<div id="outline-container-sec-1-28" class="outline-3">
<h3 id="sec-1-28">练习1.28</h3>
<div class="outline-text-3" id="text-1-28">
<p>
这个题目是费马测试的一个变形，因为费马测试会被Carmichael数骗，所以这个Miller-Rabin检查增强了限制，Carmichael数也通不过检查。增强的条件是：如果大于1小于n - 1的一个数的平方取模n等于1，则n不是素数。这样，需要我们将费马测试中的 <code>expmod</code> 函数加以改进，所有相关的过程如下：
</p>

<pre class="example">
(define (determine-result a n)
  (cond ((and (not (= a 1))
              (not (= a (- n 1)))
              (= (remainder (square a) n) 1)) 0)
        (else (remainder (square a) n))))

(define (expmod base exp m)
  (cond ((= exp 0) 1)
        ((even? exp)
         (determine-result (expmod base (/ exp 2) m) m))
        (else (remainder (* base (expmod base (- exp 1) m)) m))))

(define (miller-rabin-test n)
  (define (try-it a)
    (= (expmod a (- n 1) n) 1))
  (try-it (+ 1 (random (- n 1)))))

(define (miller-rabin-prime? n times)
  (cond ((= times 0) true)
        ((miller-rabin-test n) (miller-rabin-prime? n (- times 1)))
        (else false)))
</pre>

<p>
再用 <code>miller-rabin-prime?</code> 检测素数的时候，就算连561，1105等Carmichael数也无处遁形了。
</p>
</div>
</div>
<div id="outline-container-sec-1-29" class="outline-3">
<h3 id="sec-1-29">练习1.29</h3>
<div class="outline-text-3" id="text-1-29">
<p>
定义两个过程如下：
</p>

<pre class="example">
(define (sum-simpson-rule f k n a b)
  (define (factor)
    (cond ((or (= k 0)
               (= k n)) 1)
          ((= (remainder k 2) 0) 2)
          (else 4)))
  (if (&gt; k n)
      0
      (+ (* (factor) (f (+ a (* k (/ (- b a) n)))))
         (sum-simpson-rule f (+ 1 k) n a b))))

(define (simpson-rule f n a b)
  (* (/ (/ (- b a) n) 3) (sum-simpson-rule f 0 n a b)))
</pre>

<p>
经过测试，这个辛普森规则准得过分，在测试 <code>cube</code> 函数在0到1之间的积分时，n都不用取到100或者1000，就算取成2，结果也是精确的1/4。。。
</p>
</div>
</div>
<div id="outline-container-sec-1-30" class="outline-3">
<h3 id="sec-1-30">练习1.30</h3>
<div class="outline-text-3" id="text-1-30">
<p>
采用迭代进行计算的 <code>sum</code> 过程如下：
</p>

<pre class="example">
(define (sum term a next b)
  (define (iter a result)
    (if (&gt; a b)
        result
        (iter (next a) (+ (term a) result))))
  (iter a 0))
</pre>
</div>
</div>
<div id="outline-container-sec-1-31" class="outline-3">
<h3 id="sec-1-31">练习1.31</h3>
<div class="outline-text-3" id="text-1-31">
<p>
递归的 <code>product</code> 过程：
</p>

<pre class="example">
(define (product term a next b)
  (if (&gt; a b)
      1
      (* (term a)
         (product term (next a) next b))))
</pre>

<p>
迭代的 <code>product</code> 过程：
</p>

<pre class="example">
(define (product term a next b)
  (define (iter a result)
    (if (&gt; a b)
        result
        (iter (next a) (* (term a) result))))
  (iter a 1))
</pre>

<p>
<code>factorial</code> 过程：
</p>

<pre class="example">
(define (factorial n)
  (product (lambda (a) a) 1 (lambda (a) (+ 1 a)) n))
</pre>

<p>
求圆周率PI的过程：
</p>

<pre class="example">
(define (cal-pi n)
  (* 2.0           ;; 使用2.0而不用2，是为了让结果展示为小数而不是分数
     (if (even? n) n (+ 1 n)) ;; 这个不可缺少，下面有解释
     (/
      (product (lambda (a) (square a))
               2
               (lambda (a) (+ 2 a))
               (if (even? n) n (+ 1 n)))
      (product (lambda (a) (square a))
               3
               (lambda (a) (+ 2 a))
               (if (even? n) (+ 1 n) (+ 2 n))))))
</pre>

<p>
书中给出的求PI公式比较tricky，将等式两边乘以2，就会发现形式比书中原来的形式要完美很多，上面的过程的基础正是乘以2后的等式。分别计算分子和分母，相除后，再乘以2，但要注意的是，这时的结果还不是圆周率，还需要乘以最后一个参加计算的分子值，为什么呢？因为我们最初为图方便（为了使用平方计算），把等式两边都乘以2，这样就硬生生把分子部分的序列给向后移了一位，所以要将原来被挤掉的分子最后一个参加计算的数字给补上。
</p>
</div>
</div>
<div id="outline-container-sec-1-32" class="outline-3">
<h3 id="sec-1-32">练习1.32</h3>
<div class="outline-text-3" id="text-1-32">
<p>
递归的 <code>accumulate</code> 过程：
</p>

<pre class="example">
(define (accumulate combiner null-value term a next b)
  (if (&gt; a b)
      null-value
      (combiner (term a)
                (accumulate combiner null-value term (next a) next b))))
</pre>

<p>
迭代的 <code>accumulate</code> 过程：
</p>

<pre class="example">
(define (accumulate combiner null-value term a next b)
  (define (iter a result)
    (if (&gt; a b)
        result
        (iter (next a) (combiner (term a) result))))
  (iter a null-value))
</pre>

<p>
利用 <code>accumulate</code> 进行重定义的 <code>sum</code> 和 <code>product</code> 过程：
</p>

<pre class="example">
(define (sum term a next b)
  (accumulate + 0 term a next b))

(define (product term a next b)
  (accumulate * 1 term a next b))
</pre>
</div>
</div>
<div id="outline-container-sec-1-33" class="outline-3">
<h3 id="sec-1-33">练习1.33</h3>
<div class="outline-text-3" id="text-1-33">
<p>
<code>filtered-accumulate</code> 过程以及根据其定义的求素数和、求互素正整数积的过程：
</p>

<pre class="example">
(define (filtered-accumulate combiner null-value term a next b filter)
  (if (or (&gt; a b) (not (filter a b)))
      null-value
      (combiner (term a)
                (filtered-accumulate combiner null-value term (next a) next b filter))))

(define (sum-prime a b)
  (filtered-accumulate + 0 (lambda (a) a) a (lambda (a) (+ 1 a)) b prime?))

(define (product-gcd-prime n)
  (filtered-accumulate * 1 (lambda (a) a) 1 (lambda (a) (+ 1 a)) n gcd-eq1?))
</pre>
</div>
</div>
<div id="outline-container-sec-1-34" class="outline-3">
<h3 id="sec-1-34">练习1.34</h3>
<div class="outline-text-3" id="text-1-34">
<p>
如果求值 <code>(f f)</code> ，展开的流程如下：
</p>

<pre class="example">
(f f) =&gt; (f 2) =&gt; (2 2)
</pre>

<p>
因为2不是一个过程名，所以出错。
</p>
</div>
</div>
<div id="outline-container-sec-1-35" class="outline-3">
<h3 id="sec-1-35">练习1.35</h3>
<div class="outline-text-3" id="text-1-35">
<p>
<code>x |-&gt; 1 + 1/x</code> 的不动点即要求满足 <code>x = 1 + 1/x</code> ，两边乘以x得到 <code>x^2 = x + 1</code> ，即黄金分割满足的方程。
</p>

<p>
通过 <code>fixed-point</code> 来计算黄金分割率：
</p>

<pre class="example">
(fixed-point (lambda (x) (+ 1 (/ 1 x))) 0.5)
</pre>
</div>
</div>
<div id="outline-container-sec-1-36" class="outline-3">
<h3 id="sec-1-36">练习1.36</h3>
<div class="outline-text-3" id="text-1-36">
<p>
修改后的 <code>fixed-point</code> 过程：
</p>

<pre class="example">
(define (fixed-point f first-guess)
  (define (close-enough? v1 v2)
    (&lt; (abs (- v1 v2)) 0.0000001))
  (define (try guess)
    (let ((next (f guess)))
      (display next)
      (newline)
      (if (close-enough? guess next)
          next
          (try next))))
  (try first-guess))
</pre>

<p>
不使用平均阻尼：
</p>

<pre class="example">
(fixed-point (lambda (x) (/ (log 1000) (log x))) 2)
</pre>

<p>
使用平均阻尼：
</p>

<pre class="example">
(fixed-point (lambda (x) (average x (/ (log 1000) (log x)))) 2)
</pre>

<p>
允许误差为10e-7的情况下，不使用平均阻尼需要46步，使用平均阻尼只需要13步。可见使用平均阻尼能大大减少必要的计算步数。
</p>
</div>
</div>
<div id="outline-container-sec-1-37" class="outline-3">
<h3 id="sec-1-37">练习1.37</h3>
<div class="outline-text-3" id="text-1-37">
<p>
递归的 <code>cont-frac</code> 过程：
</p>

<pre class="example">
(define (cont-frac n d k)
  (define (frac i)
    (if (&gt; i k)
        0
        (/ (n i)
           (+ (d i) (frac (+ 1 i))))))
  (frac 1))
</pre>

<p>
迭代的 <code>cont-frac</code> 过程：
</p>

<pre class="example">
(define (cont-frac n d k)
  (define (iter i result)
    (if (&lt; i 1)
        result
        (iter (- i 1)
              (/ (n i)
                 (+ (d i) result)))))
  (iter k 0))
</pre>

<p>
用下面的lambda过程来确定满足条件的k：
</p>

<pre class="example">
((lambda (k)
   (&lt; (abs (- (/ 1 (cont-frac (lambda (i) 1.0)
                              (lambda (i) 1.0)
                              k))
              1.61803401))
      0.0001))
 11)
</pre>

<p>
最后确定，k取11即可保证4位的十进制精度。
</p>
</div>
</div>
<div id="outline-container-sec-1-38" class="outline-3">
<h3 id="sec-1-38">练习1.38</h3>
<div class="outline-text-3" id="text-1-38">
<p>
这个题目最关键的是确定 <code>D(i)</code> 函数的值，观察规律，可以知道，序列中的3n项和3n+1项都是1，而3n+2项的值是2n+2，这里n是非负整数。所以，=D(i)= 相应的过程定义如下：
</p>

<pre class="example">
(define (d i)
  (cond ((or (= (remainder i 3) 0)
             (= (remainder i 3) 1)) 1)
        (else (/ (* 2 (+ 1 i)) 3))))
</pre>

<p>
用来求e的程序：
</p>

<pre class="example">
(+ 2
   (cont-frac (lambda (i) 1.0) d 100000))
</pre>
</div>
</div>
<div id="outline-container-sec-1-39" class="outline-3">
<h3 id="sec-1-39">练习1.39</h3>
<div class="outline-text-3" id="text-1-39">
<p>
<code>tan-cf</code> 过程如下：
</p>

<pre class="example">
(define (tan-cf x k)
  (define (n i)
    (if (= i 1) x (square x)))
  (define (d i)
    (- (* 2 i) 1))
  (define (cf i)
    (if (&gt; i k)
        0
        (/ (n i)
           (- (d i) (cf (+ 1 i))))))
  (cf 1))
</pre>
</div>
</div>
<div id="outline-container-sec-1-40" class="outline-3">
<h3 id="sec-1-40">练习1.40</h3>
<div class="outline-text-3" id="text-1-40">
<pre class="example">
(define (cubic a b c)
  (lambda (x)
    (+ (cube x)
       (* a (square x))
       (* b x)
       c)))
</pre>
</div>
</div>
<div id="outline-container-sec-1-41" class="outline-3">
<h3 id="sec-1-41">练习1.41</h3>
<div class="outline-text-3" id="text-1-41">
<p>
<code>double</code> 过程：
</p>

<pre class="example">
(define (double f)
  (lambda (x) (f (f x))))
</pre>

<p>
表达式的值是21，因为两次 <code>double</code> 调用就得到4层 <code>double</code> 嵌套的过程，再对 <code>inc</code> 作用，就会得到2的4次方，即16次 <code>inc</code> 过程的调用，所以结果是5 + 16 = 21。
</p>
</div>
</div>
